{"pageProps":{"title":"faith: or, things make sense","hast":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The amount of sense that things \"ought\" to make.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"There is a way in which the world systematically wears down you understanding of the world over time: this is that, as you gain experience with the world's "},{"type":"element","tagName":"a","properties":{"href":"id:55b05db4-8350-4387-80b4-16c7774c6cf2"},"children":[{"type":"text","value":"messiness and complexity"}]},{"type":"text","value":", or spend extended periods in pathological corners of it (remember, exceptions are often the norm - see "},{"type":"element","tagName":"a","properties":{"href":"/20210721200800-cfar_modules#adjust-your-seat"},"children":[{"type":"text","value":"adjust your seat"}]},{"type":"text","value":"), you downgrade your confidence in your models of reality across the board. This is because, even if they are essentially or generally correct, or have been built along the correct lines, they do not have enough predictive power for you locally.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"There is an optimal error rate for learning for many reasons (presumably), and one of those is that if you are wrong too often, you cannot put weight on/any/ of your candidate models of reality. You need to be right often enoguh to know along what lines to build.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In addition, if stakes are high in the learning context, then one becomes very risk averse in a universe where it is hard to be right - because approximate correctness might be good enough to iterate on, but that's useless to someone who doesn't have the opportunity to iterate.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"\"Approximately correct\" is also insufficient when the target is fragile - when you can't get most of the value from a situation by exploiting the Pareto curve.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"If you have been playing at a harder level than is optimal for learning for a long while, you develop certain crutches and bad habits around it that make general-purpose learning much harder later on.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Having unlearned all of these, however, you may see a haesitance that seems broader-based, insubstantial, and inconquerable, beneath all the calculus of habit. This is the systematic buildup of the belief that you are not good at predicting the world, or at moving through it.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Call this, the base rate of how well you think you understand your universe, faith.\n"}]}]},"filetags":{},"backlinks":[{"path":"/20240822202157-my_non_poetry_writing","title":"My Non-Poetry Writing"}]},"__N_SSG":true}