{"pageProps":{"title":"[[https://en.wikipedia.org/wiki/Kuleshov_effect][Kuleshov effect - Wikipedia]]","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://en.wikipedia.org/wiki/Kuleshov_effect"},"children":[{"type":"text","value":"https://en.wikipedia.org/wiki/Kuleshov_effect"}]}]}]},{"type":"element","tagName":"div","properties":{"className":["example"]},"children":[{"type":"text","value":"In the famous \"Definition of Happiness\" interview which was part of the CBC Telescope program, Hitchcock also explained in detail many types of editing to Fletcher Markle.[5] The final form, which he calls \"pure editing\", is explained visually using the Kuleshov effect. In the first version of the example, Hitchcock is squinting, and the audience sees footage of a woman with a baby. The screen then returns to Hitchcock's face, now smiling. In effect, he is a kind old man. In the second example, the woman and baby are replaced with a woman in a bikini, Hitchcock explains: \"What is he now? He's a dirty old man.\"\n\nThe experiment itself was created by assembling fragments of pre-existing film from the Tsarist film industry, with no new material. Mosjoukine had been the leading romantic \"star\" of Tsarist cinema, and familiar to the audience.\n\nKuleshov demonstrated the necessity of considering montage as the basic tool of cinema. In Kuleshov's view, the cinema consists of fragments and the assembly of those fragments, the assembly of elements which in reality are distinct. It is therefore not the content of the images in a film which is important, but their combination. The raw materials of such an art work need not be original, but are prefabricated elements which can be disassembled and reassembled by the artist into new juxtapositions.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"\"Montage as the basic tool of cinema\" appears to have a lot in common with \"composition of images\" being the basic tool of comics. Perhaps one way to identify and differentiate one medium from another would be to ask: what is the medium's composition rule?\n"}]}]},"filetags":{},"backlinks":[{"path":"/20221214121510-composition","title":"Composition"}]},"__N_SSG":true}