{"pageProps":{"title":"Caplin, Andrew :: Economic Data Engineering","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"authors"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"text","value":"Caplin, Andrew"}]},{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://www.nber.org/papers/w29378"},"children":[{"type":"text","value":"https://www.nber.org/papers/w29378"}]}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Paper about the exciting new frontier of domain-specific ontologies for economic analysis. In the vein of the neuroeconomics project, it centers a \"theory-led\" approach. I seriously doubt its having engaged with the ungrounded model semantics problem properly, but it does take the trouble to name it, give it a subheading (\"Fundamental Identification\"), and give me a citation for it. So it might be worth reutrning to, maybe even as a source for precise delineations of viewpoints that I see the semantics problem in.\n"}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In formal terms, even if the econometrician observes actions, states, and\nprizes, both the decision maker’s utility function and the posteriors about the\nstate of the world are subjective (this was highlighted by Machlup, 1993, in dif-\nferentiating between the contents of a transmitted message and comprehension\nof it). The path forward that data engineering suggests is to follow Samuelson’s\nlead and to conceptualize an ideal data set that allows beliefs and utilities to\nbe separately identified. In fact this is precisely what Block and Marschak,\n1959, proposed when introducing stochastic choice data into economic analysis.\nWhile modeling randomness in utility, they were intimately aware of psycho-\nlogical models dating back to Thurstone, 1927, 1931, and Luce, 1956, 1958, in\nwhich stochasticity in choice derives from the imperfect ability to discriminate\nbetween “percepts”. For that reason they were powerfully struck by the identi-\nfication problem as between beliefs and utility, or “information and desirability”\nas they phrased it (Block and Marschak, 1959 p. 1.6).\n"}]}]}]},"filetags":{},"backlinks":[]},"__N_SSG":true}