{"pageProps":{"title":"\"if\" in a story: \"'if alive, may the sea foam milk. If dead, may it foam blood.' it foamed blood...\"","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://europeisnotdead.com/lithuania-egle-the-queen-of-serpents/"},"children":[{"type":"text","value":"https://europeisnotdead.com/lithuania-egle-the-queen-of-serpents/"}]}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"What is the point of including ifs in a story? It will only ever have turned out one way, and the reader or listener will know that it only turns out one way (or in the above case, is only a confirmation of what has already been told), so it's nothing more than the cruft of setup for the inclusion of an anaphora...\nSo we ask, why this? Why must it be the seafoam that is called upon, why milk, why blood? The grandeur of the request might be part of the point, or the magical nature of the response; or the sea' ties to the snake-king, and the sea's right to mourn, to rage; an actor, an ally, where we would see set dressing; or a world that is alive, that is understood as if it were an actor; as if there is no such thing as a dead setting.\nanthropically speaking, that if pulls a lot of weight.\nThe emotion of the asker, too; the events flow within and through the daughter and bride who has been betrayed, like in all betrayal stories; and the moment of revelation an "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"internal"}]},{"type":"text","value":" event whose impact on the external is the entire plot; an emotion which is a fulcrum on which all the most important events turn. the nature of the betrayed, too, the soil in which that discovery sprouts: \"...she turned herself and her children to trees in her grief...\"\nSo the anaphora lets us experience-alongside - she must ask the question, so we can see in the words of the story what her receipt of the answer is and how it happens...we need to experiene her doubt, and the cleanest linguistic representation of a doubt is the word \"if\".\n"}]}]},"filetags":{},"backlinks":[]},"__N_SSG":true}