{"pageProps":{"title":"faith: or, things make sense","hast":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The amount of sense that things \"ought\" to make.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"There is a way in which the world systematically wears down your understanding of the world over time:\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"As you gain experience with the world's "},{"type":"element","tagName":"a","properties":{"href":"id:55b05db4-8350-4387-80b4-16c7774c6cf2"},"children":[{"type":"text","value":"messiness and complexity"}]},{"type":"text","value":", or spend extended periods in pathological corners of it (remember, exceptions are often the norm - see "},{"type":"element","tagName":"a","properties":{"href":"/20210721200800-cfar_modules#adjust-your-seat"},"children":[{"type":"text","value":"adjust your seat"}]},{"type":"text","value":"), you downgrade your confidence in your models of reality across the board. This happens even if those models are mostly correct, even if you're building them correctly, because they won't have enough predictive power for you "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"in your locale"}]},{"type":"text","value":". They won't be of use to you personally. You won't experience them as increasing your affordances.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"There is an optimal error rate for learning for many reasons.\n"}]},{"type":"element","tagName":"ul","properties":{},"children":[{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"If you are wrong too often, you cannot put weight on/any/ of your candidate models of reality. You need to be right often enough to know along what lines to build. Subjectively, you will experience this as boredom or fog.\n"}]}]},{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"If the stakes of failure are high while you are learning, then you learn first to be very risk averse - approximate correctness might be good enough to iterate on, but that's useless to someone who doesn't have the opportunity to iterate. This will feel like fear, then rigidity. Coupled with the thrill that comes with getting a high-stakes thing "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"right"}]},{"type":"text","value":", you'll see dynamics of scrupolosity, zeal, fanaticism; or with a different balance, complacency, cliqueishness, sophistry.\n"}]}]},{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"\"Approximately correct\" is useless for things you can't approximate. You need to be content with unrewarding learning for a long period, or receive guidance, to learn things that resist the learning this way. Feel this in drills, mindless habitual brain-training learning modes; rigidity, tradition, the matsarya of selection effects seen from the inside. Also in hopelessness, frustration, despair, often reflected inot worth stories.\n"}]}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"All of these are ways in which learning can be too hard.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"If you have been playing at a harder level than is optimal for learning for a long while, you develop crutches and bad habits around it that make general-purpose learning much harder later on.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Having unlearned those crutches, however, you may see a hesitance that seems broader-based, insubstantial, and inconquerable, beneath all the cruft. Somthing more storyless.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"This is the systematic buildup of the belief that you are not good at predicting the world, or at moving through it.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It's the \"is\" behind the risk-aversion's \"ought\" - the belief that drives the strategy. Your priors on how well you understand your universe. Your sense of how much things in general make sense.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Call this faith.\n"}]}]},"filetags":{},"backlinks":[{"path":"/20240822202157-my_non_poetry_writing","title":"Non-Poetry Writing"},{"path":"/all_pages","title":"All Pages"}]},"__N_SSG":true}