{"pageProps":{"title":"e.e. cummings - A Poet's Advice","hast":{"type":"root","children":[{"type":"element","tagName":"pre","properties":{"className":["verse"]},"children":[{"type":"text","value":"A poet is somebody who feels, and who expresses his feeling through words.\nThis may sound easy. It isn’t.\nA lot of people think or believe or know they feel-but that’s thinking or believing or knowing; not feeling. And poetry is feeling-not knowing or believing or thinking.\nAlmost anybody can learn to think or believe or know, but not a single human being can be taught to feel. Why? Because whenever you think or you believe or you know, you’re a lot of other people: but the moment you feel, you’re nobody-but-yourself.\nTo be nobody-but-yourself-in a world which is doing its best, night and day, to make you everybody else-means to fight the hardest battle which any human being can fight; and never stop fighting.\nAs for expressing nobody-but-yourself in words, that means working just a little harder than anybody who isn’t a poet can possibly imagine. Why? Because nothing is quite as easy as using words like somebody else. We all of us do exactly this nearly all of the time-and whenever we do it, we’re not poets.\nIf, at the end of your first ten or fifteen years of fighting and working and feeling, you find you’ve written one line of one poem, you’ll be very lucky indeed.\nAnd so my advice to all young people who wish to become poets is: do something easy, like learning how to blow up the world-unless you’re not only willing, but glad, to feel and work and fight till you die.\nDoes this sound dismal? It isn’t.\nIt’s the most wonderful life on earth.\nOr so I feel.\n"}]},{"type":"element","tagName":"ul","properties":{},"children":[{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Reproduced in the foreword of "},{"type":"element","tagName":"a","properties":{"href":"/20220715143526-critical_path_buckminster_fuller"},"children":[{"type":"text","value":"Critical Path - Buckminster Fuller"}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"  I'm not claiming to be a poet or that this book is poetry, but I knew cummings well enough to be confident that he would be happy that I had written it.\n"}]}]}]}]}]},"filetags":":poetry:bravery:","backlinks":[{"path":"/all_pages","title":"All Pages"}]},"__N_SSG":true}