{"pageProps":{"title":"Novikov, Dmitry A. and Chkhartishvili, Alexander G., Reflexion and Control: Mathematical Models","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"authors"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"text","value":"Novikov, Dmitry A. and Chkhartishvili, Alexander G."}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Treatise on control systems with reflexion in them. Looks like a general treatment of "},{"type":"element","tagName":"a","properties":{"href":"/20250127222148-epistemic_games"},"children":[{"type":"text","value":"Epistemic games"}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"This book is dedicated to modern approaches to mathematical modeling of reflexion in control (including an important class of game-theoretic models–reflexive games describing the interaction of subjects making decisions based on an hierarchy of beliefs about essential parameters, beliefs about beliefs, etc.).\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Reflexion. A fundamental property of human entity lies in the following. In addition to natural (“objective”) reality, there exists its image in human minds. Furthermore, an inevitable gap (mismatch) takes place between the latter and the former. In the sequel, the described image will be called a part of reflexive reality.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Traditionally, purposeful study of this phenomenon relates to the term “reflexion.” The term reflexion (from Latin reflex ‘bent back’)\nmeans:\n"}]},{"type":"element","tagName":"ul","properties":{},"children":[{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"a principle of human thinking, guiding humans towards comprehension and perception of one’s own forms and premises;\n"}]}]},{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"subjective consideration of a knowledge, critical analysis of its content and cognition methods;\n"}]}]},{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"the activity of self-actualization, revealing the internal structure and specifics of spiritual world of a human.\n"}]}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The term “reflexion” was first suggested by J. Locke. However, in different philosophical systems (the ones by J. Locke, G. Leibniz, D. Hume, G. Hegel, etc.), reflexion has various interpretations. In psychology, systematical treatment of reflexion dates back to the 1960s (V. Lefebvre’s scientific school). Note one may view reflexion in another interpretation connected with a reflex (a reaction of a living organism to excited receptors). In the present book, we employ the first (philosophical) definition of reflexion.\n"}]}]}]},"filetags":{},"backlinks":[]},"__N_SSG":true}