{"pageProps":{"title":"Porges , Orienting in a Defensive World: Mammalian Modifications of Our Evolutionary Heritage. A Polyvagal Theory","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"authors"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"text","value":"Porges, S. W."}]}]},{"type":"element","tagName":"h1","properties":{"id":"painsci-notes-on-porges-1995"},"children":[{"type":"text","value":"PainSci notes on Porges 1995:"}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"This is a simple translation of the abstract: no editorializing here, just putting it into relatively plain English.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The vagus nerve regulates the guts, including and especially the heart. Its emerges from two distinct areas of the brain, the "},{"type":"element","tagName":"a","properties":{"href":"/20230709111538-anatomy_of_the_vagus_nerve"},"children":[{"type":"text","value":"nucleus ambiguus and dorsal motor nucleus"}]},{"type":"text","value":". These regions are both connected to the heart via the vagus nerve, but (hypothesis) the NA fibres are responsible for coordinating heart rate with respiration (respiratory sinus arrhythmia). “Divergent shifts in RSA and heart rate are explained by the independent actions” of these areas. Polyvagal theory emphasizes the evolution of this system and proposes that mammals (as opposed to reptiles) have an area of the brain stem (including NA) devoted to attention, motion, emotion, and communication, which can sometimes be at odds with signalling from the dorsal motor nucleus, and this could explain clinical disorders like sudden infant death syndrome and asthma. So polyvagal theory is basically the idea that the viscera are regulated (via the vagus nerve) by two different parts of the brain stem that don’t always play well together.\n"}]}]}]},"filetags":{},"backlinks":[]},"__N_SSG":true}