{"pageProps":{"title":"Self-Directed Learning","hast":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In the online course "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"Uncommon Sense Teaching"}]},{"type":"text","value":" "},{"type":"element","tagName":"a","properties":{"href":"/UncommonSenseTeaching","title":"Uncommon Sense Teaching"},"children":[{"type":"text","value":"UncommonSenseTeaching"}]},{"type":"text","value":", Beth Rogowsky makes the claim that slow learners have this advantage over fast ones: that they simply spend more time with the material. The model of learning being presented in that module of the course is of "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"contextual learning"}]},{"type":"text","value":" - the idea that the mechanics of learning rely heavily on the connecitons "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"between"}]},{"type":"text","value":" contexts - in fact, that connecting new concepts together with ones we already know is the primary activity involved in learning. It of course follows that learners that spend more time making connections to a concept have a chance to understand it more deeply - while those who are capable of using their critical thinking to arrive at complex conclusions more quickly lost out on that benefit.\nThe course, being a pedagogy course, discusses how effects like these, which are in fact not the natural consequences of any learning style, but rather of the shear stress between learning and teaching, can be avoided. One key component of the set of strategies presented is to ensure that learners of all speeds are actively working on a challenge related to the topic being taught for the duration of the allotted lesson time - even if this means that students are working on different material in the same room. The reason given is that teachers ought to concern themselves more with the extent of active, attentive contact a student is getting with a concept than they ought to track students' abililty to meet a common standard of performance.\nAt first glance, this appears to represent an enormous amount of work for educators - adjusting a lesson plan to accommodate the pace variation of a classroom's worth of students seems quite difficult. Among the more fascinating methods of tailoring workload to students that the course presents is the option to allow students to "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"self-direct"}]},{"type":"text","value":".\n"}]}]},"filetags":{},"backlinks":[]},"__N_SSG":true}