{"pageProps":{"title":"How to read","hast":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"When I was a kid, I read a lot. I struggle to say what I mean here - I didn't read unreflectively, because it wasn't easy at first. I didn't read forgetfully or without being affected, because I remember rereading as central to the experience - poring, caressing words on the page and in my mind, meditating in a way that felt like the feel of paper under my fingers. It could come closer to the point to say that I read the way one speaks a language - naturally, whatever that means. Guided by instinct and taste. Whatever I was reading taught me to read.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It occurred to me today ("},{"type":"element","tagName":"span","properties":{"className":["timestamp"]},"children":[{"type":"text","value":"[2024-08-29 Thu]"}]},{"type":"text","value":" ) that I had a skill I haven't been using or some time - of creatinga space for the thing I was reading in my mind where it didn't quite have to touch eveyrthing else in my mind just yet. I have in recent years been having trouble with managing the opening of questions as I read - branching-off thoughts that all feel precious, beautiful, drugging - but the problem is of "},{"type":"element","tagName":"span","properties":{"className":["underline"],"style":"text-decoration: underline;"},"children":[{"type":"text","value":"serialising"}]},{"type":"text","value":" these into an experience that lets me be "},{"type":"element","tagName":"a","properties":{"href":"id:85c4249a-06c1-4ee1-9107-890f705cb69a"},"children":[{"type":"text","value":"serious"}]},{"type":"text","value":" about the reading and the thinking both. We run once more into the problem of "},{"type":"element","tagName":"a","properties":{"href":"/20240829215940-tsundoku"},"children":[{"type":"text","value":"budget"}]},{"type":"text","value":" - it is impossible to do everything that you could do before you die. And it turns out, waiting in the back halls of my mind for me to remember it again was a skill I had already bult, back before the skillset was something I ever needed to make legible for myself: of holding the fear carefully within my field of vision, and responding to it with a superficially paradoxical response - "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"not yet"}]},{"type":"text","value":".\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"These things - skills and legibility, form and weight - come in cycles. Reading is a much weightier activity these days than it was when I was a child. Back then I had the luxury of rewriting myself whenever I felt like it, because I hadn't done much writing of self yet. Everything was illegible, everything was a mystery to come to fresh. What used to be easy will now take some bravery to do. But as I've built the muscle to weild the tool, the old skill has come back, and with it the ability to describe what it is I'm doing.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It's generally much harder to describe what it is you're doing than to do it: the nature of fiction is a good example. SEP has a good section on "},{"type":"element","tagName":"a","properties":{"href":"https://plato.stanford.edu/entries/fiction/#FictAuthPret"},"children":[{"type":"text","value":"authorial pretense"}]},{"type":"text","value":", where they try to work through how to characterise the space in which fiction occurs. Urslua K Le Guin has a  "},{"type":"element","tagName":"a","properties":{"href":"/20221101155800-uklg_comment_about_absolute_belief_coexisting_with_knowledge_that_one_has_no_reason_to_believe_and_many_to_disbelieve_is_weirdly_useful_for_a_textbook_also"},"children":[{"type":"text","value":"suitably paradoxical characterisation of suspension of disbelief"}]},{"type":"text","value":" that begins with the status of writing as "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"art"}]},{"type":"text","value":", from which premise the double nature of communication through writing follows more neatly than you'd expect.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Why does talking to other people change me? Why does reading change me? There are thin and thick answers. Thinly, because I'm a social animal - I'm built to be changed by what I'm given to understand. The thick answer is a work in progress, and the work consists of elaborating that sentence.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Related: "},{"type":"element","tagName":"a","properties":{"href":"/strengthening-the-student-toolbox#elaborative-interrogation-and-self-explanation"},"children":[{"type":"text","value":"Elaborative interrogation and self explanation"}]}]}]},"filetags":{},"backlinks":[]},"__N_SSG":true}