{"pageProps":{"title":"bias is two things - measurement and mechanism","hast":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"From: "},{"type":"element","tagName":"a","properties":{"href":"/a_conversation_with_daniel_kahneman_about_noise_by_evan_nesterak_behavioral_scientist"},"children":[{"type":"text","value":"A Conversation with Daniel Kahneman About “Noise” - By Evan Nesterak - Behavioral Scientist"}]},{"type":"text","value":":\n"}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"On the one hand, bias is an average error. On the other hand, it’s a psychological mechanism, and it’s a psychological observation. There are mechanisms that cause systematic errors in people’s judgments and in people’s decisions, and those errors are called biases. And it’s basically a psychological mechanism that explains events inside the individual—why an individual is inclined to make one mistake or another.\n"}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"There is the value that is derived from observed error, and there is the latent set of factors that we assume drives the value. The connection between these is a posited causal model.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Again, the error is characterised relative to a \"right answer\", to a decision that reflects the latent set of concerns attributed to the actor generating the data.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"So in the case of bias, we have an actor's \"win condition\", then their observed actions, and the delta between these which call error. The mean of error is bias. This value is assumed to be driven by a feature of the mechanism that the actor in question runs to make decisions, which we therefore also call bias.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"strong","properties":{},"children":[{"type":"text","value":"How do you justify this equivalence?"}]}]}]},"filetags":{},"backlinks":[]},"__N_SSG":true}