{"pageProps":{"title":"[[https://www.themarginalian.org/2022/08/10/ed-yong-an-immense-world-color/][Psychedelic Dinosaurs, Four-Dimensional Hummingbirds, and How We Got Our Vision: Color, Consciousness, and the Dazzling Universe of Tetrachromacy – The Marginalian]]","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://www.themarginalian.org/2022/08/10/ed-yong-an-immense-world-color/"},"children":[{"type":"text","value":"https://www.themarginalian.org/2022/08/10/ed-yong-an-immense-world-color/"}]}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"\nEarth teems with sights and textures, sounds and vibrations, smells and tastes, electric and magnetic fields. But every animal can only tap into a small fraction of reality’s fullness. Each is enclosed within its own unique sensory bubble, perceiving but a tiny sliver of an immense world.\n"}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"But then, in a mere century of science — a blink of evolutionary time — numerous birds, fish, reptiles, and insects were reluctantly admitted into the UV-sighted ranks. Still, we excluded mammals from the realm of possibility — this is the history of our species — until, in a humbling testament to Richard Feynman’s insistence that the imagination of nature will always exceed that of the human animal, a team of scientists discovered a short cone tuned to UV light in three species of rodents. Within half a human generation, many mammals — including dogs, cats, reindeer, cows, and ferrets — were discovered to detect UV light with their short blue cones.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Now we know that most animals can perceive ultraviolet, and we are the unfortunate flukes.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Even some human animals — those who have had their lenses damaged in some way — can perceive the UV end of the spectrum as a pale blue, none more famous than Claude Monet and his water lilies, the dazzling product of his refusal to have his cataracts — a progressive clouding of the lens that filters color — surgically removed; instead, he went on painting the world as he saw it, increasingly warping the electromagnetic spectrum into otherworldly colors.\n"}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":" Fuckin\n Tetrachromacy\n ugh\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":" Related: "},{"type":"element","tagName":"a","properties":{"href":"/20230808103246-line_of_purples_wikipedia"},"children":[{"type":"text","value":"Line of purples - Wikipedia"}]}]}]},"filetags":{},"backlinks":[{"path":"/20221214154901-perception_of_color","title":"perception of color"}]},"__N_SSG":true}