{"pageProps":{"title":"Teaching Is Learning Is Teaching","hast":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In 2016 I had the privilege to attend a workshop run by the Centre for Applied Rationality - a nonprofit organization dedicated to refining the applications of cognitive and behavioral science in order to improve human decision making in ways that actual humans might reflectively endorse. Interestingly, their work drew heavily from theory of pedagogy, especially mathematical pedagogy.\nA key concept I learned in that workshop was the idea of pedagogical content knowledge: defined as the portion of one's knowledge about a particular domain that is critical to being able to transmit it to others. An example drawn from mathematical pedagogy is the insight that some people encode ideas visually, whereas other encode them syumbolically; and that this presents as differences both in how someone might choose to explain a concept, and how well someone understands an explanation in a given mode. (Another interesting example that makes a good parlor trick is to ask everyone in the room to silently multiply two three-digit numbers, and then go around the room asking everyone the exact steps they took while doing it. This is special fun in Indian undergraduate STEM circles, where everyone has developed excellent, often esoteric, heuristics and tricks for being able to perform this task quickly in exam setttings.)\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Pedagogical content knowledge (hereafter PCK) has this crucial property: it is "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"symmetric"}]},{"type":"text","value":". The information needed to successfully communicate with someone about a concept within a given concept space is the same "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"regardless of which person is teaching or learning"}]},{"type":"text","value":". In addition, some nonempty portion of PCK will be unique to an individual.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"This means that the practice of teaching is inextricable, eo ipso, from the practice of learning; and in this ouroboros structure, we see perhaps our first incontrovertible argument for learning being a fundamentally solitary endeavour. If this argument holds, then self-directed learning is not "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"one possible mode"}]},{"type":"text","value":" of learning, but rather the "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"only"}]},{"type":"text","value":" possible mode. Teachers, like tuning forks, need only be present in the room, merely in order to allow the student to learn how to learn.\n"}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Therefore a sage has said, 'I will do nothing (of purpose), and the people will be transformed of themselves; I will be fond of keeping still, and the people will of themselves become correct. I will take no trouble about it, and the people will of themselves become rich; I will manifest no ambition, and the people will of themselves attain to the primitive simplicity.'\n"}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"cite:leggeTaoTeChing2013"},"children":[{"type":"text","value":"cite:leggeTaoTeChing2013"}]}]}]},"filetags":{},"backlinks":[]},"__N_SSG":true}