{"pageProps":{"title":"Gutenprint - Wikipedia","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://en.wikipedia.org/wiki/Gutenprint"},"children":[{"type":"text","value":"https://en.wikipedia.org/wiki/Gutenprint"}]}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Gutenprint (formerly Gimp-Print) is a collection of free-software printer drivers for use with UNIX spooling systems, such as CUPS, lpr and LPRng. These drivers provide printing services for Unix-like systems (including Linux and macOS), RISC OS and Haiku.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It was originally developed as a plug-in for the GIMP, but later became a more general tool for use by other programs and operating systems (macOS and Windows). When Apple introduced Mac OS X, it omitted printer drivers, claiming that it was the printer manufacturer's task to produce these. Many of them did not update their drivers, and since Apple had chosen to use CUPS as the core of its printing system, Gimp-Print filled the void.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Gutenprint has more than 1,300 drivers for Apollo, Apple, Brother, Canon, Citizen, Compaq, Dai Nippon, DEC, Epson, Fujifilm, Fujitsu, Gestetner, HP, IBM, Infotec, Kodak, Kyocera, Lanier, Lexmark, Minolta, NEC, NRG, Oki, Olivetti, Olympus, Panasonic, PCPI, Raven, Ricoh, Samsung, Savin, Seiko, Sharp, Shinko, Sony, Star, Tally, Tektronix and Xerox printers.[3]\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Many users incorrectly called it Gimp, so the software was renamed Gutenprint to clearly distinguish it from the GIMP. The name Gutenprint recognizes Johannes Gutenberg, the inventor of the movable type printing press.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Contents\n1       Epson backend\n2       Canon backend\n3       Unmaintained backends\n4       See also\n5       References\n6       External links\nEpson backend[edit]\nThe Epson backend is in active development; new printers, bug fixes and capability additions are contributed in each new release.\n"}]}]}]},"filetags":{},"backlinks":[{"path":"/20240822172301-printing","title":"Printing"}]},"__N_SSG":true}