{"pageProps":{"title":"Why Deafening Engineering? Because onto(ethico)epistemologies. | Mel Chua","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://melchua.com/blog/2018/03/13/why-deafening-engineering-because-ontoethicoepistemologies/"},"children":[{"type":"text","value":"https://melchua.com/blog/2018/03/13/why-deafening-engineering-because-ontoethicoepistemologies/"}]}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Ontologies. Plural. What is, what might have been, what might yet be. This is a pretty stark contrast to ontology engineering, which is a different (and more engineering/computing-native) approach to the notion of ontology. Ontology engineering is an attempt to document the singular, rather than embrace the tensions of the multiple. Both have their place, but one has been more dominant in engineering/computing thought than the other, and unconsciously so -- the same way most STEM researchers are working within a post-positivist paradigm, but don't (yet) know it.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"So why all the Deaf/ASL resources?\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Well... it's a rethinking of the world, and one that's taken place within a lot of living memory (and one that happens to be extraordinarily accessible to me). The past several decades have seen an explosion into the public sphere of a radical rethinking of what ASL is, what Deafness is, and what all these things could be. We've gone from \"it's not really a language, it's a system of crude gestures\" and \"what a terrible disability\" to... something that's exploded our notions of what language is and how it works. And linguistics had to figure out and built analysis tools and systems that could work with signed languages. A rapid turn-about between \"what would this even look like?\" to \"maybe it looks like this, or this, or...this?\" because... people... made it.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"And then came the (again, radical!) idea that ASL could be used as an academic language, just like one might use English (or earlier, French... or German... or Latin...) as an academic language of instruction -- and then publication. What does it mean to publish in a signed language? Again, there was no existing answer. So people made one. And then things like: what would an ASL-based software interface look like? We didn't know. And then ASLClear came out as one answer.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"That's why I'm looking at these resources. Because I see in them a making of a world; the figuring-out and birthing of things that have never existed before. They happen to be Deaf; it happens to be a very, very good example for me to look at right now -- but it's the process of the birth of worlds and universes that thrills me, and I want to look across worlds at the process of that birthing.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"You see that? Do you see why I'm excited by this, why I love it, why I see it as so much bigger than just \"Deaf Stuff In Engineering?\" It's what Deaf Engineering (and queer engineering, and Hispanic engineering, and...) points to. We don't know, it doesn't exist... (see the ontoepistemology in there? the knowing, and the being?) -- and then we make it. And we find out what things might be possible. And the ethics inherent in that (re)creation of the world -- what and who does our making and remaking let in, who does it keep out? -- that's where it gets ontoethicoepistemological. Nothing is value-neutral; nothing is apolitical. And nothing on this earth is going to be perfectly fair and universal and utopian; let's not pretend it is; let's be aware of our own footfalls in these spaces that we share.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I am so afraid of writing about this, thinking about it, letting it be known I'm interested in things that include the words \"Deaf\" and \"ASL\" and \"engineering\" in it, because -- as I mentioned in a previous blog post -- these kinds of things can be oversimplified and totalizing to one's scholarly identity, to how others describe and understand one's work. It's really important to me that I not get pigeonholed into \"just\" doing Deaf Engineering Things. Because there's so much more out there. There's so much, and I want to see and play within it, too.\n"}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"strong","properties":{},"children":[{"type":"text","value":"vibrates"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"/20220830184930-phenomenology_vs_ontology"},"children":[{"type":"text","value":"phenomenology vs, ontology"}]}]}]},"filetags":{},"backlinks":[]},"__N_SSG":true}