{"pageProps":{"title":"in this house we are cringe — I literally love topology so much. I've been...","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://topoillogical.tumblr.com/post/681335681383104512/i-literally-love-topology-so-much-ive-been"},"children":[{"type":"text","value":"https://topoillogical.tumblr.com/post/681335681383104512/i-literally-love-topology-so-much-ive-been"}]}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I literally love topology so much. I’ve been playing a really fun game recently, where I’ve written almost 100 topological properties down, ranging from simple like “compact” and “connected”, to esoteric like “countably metacompact”, “angelic”, or “alexandrov”, to non-named general properties like “abelian fundamental group”, “removing a point makes the space disconnected”, “nowhere locally homeomorphic to R”, to silly – one propery is “door”, which means every subset is either open or closed.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"You roll a number between about 1 and 200, and if it’s odd you take the property corresponding to that number (properties are listed out with the odd numbers), and if it’s even, you take the negation of the property beneath it. Write this down. Roll again. Now you have a new property! If this property contradicts your previous property, prove it. If this property is implied by your previous property, prove it. And if this property is neither implied nor contradictory, prove THAT by coming up with an example that has and does not have the property, and add the property to your list. Roll again. Now you have to check the consistency of your new property with both the previous ones. Keep going as long as you can! You lose when you can’t figure out the answer to a property you added, but you can never FULLY lose aside from giving up, since you can always come back to it!\n"}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Good game format for any subject with a bestiary.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"cousin to "},{"type":"element","tagName":"a","properties":{"href":"/20210710123200-make_it_interesting_the_game"},"children":[{"type":"text","value":"Make It Interesting: The Game"}]}]}]},"filetags":{},"backlinks":[]},"__N_SSG":true}