{"pageProps":{"title":"[[https://wikiless.tiekoetter.com/wiki/Line_of_purples?lang=en][Line of purples - Wikipedia]]","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://en.wikipedia.org/wiki/Line_of_purples"},"children":[{"type":"text","value":"https://en.wikipedia.org/wiki/Line_of_purples"}]}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In color theory, the line of purples or purple boundary is the locus on the edge of the chromaticity diagram formed between extreme spectral red and violet. Except for these endpoints of the line, colors on the line are non-spectral (no monochromatic light source can generate them). Rather, every color on the line is a unique mixture in a ratio of fully saturated red and fully saturated violet, the two spectral color endpoints of visibility on the spectrum of pure hues. Colors on the line and spectral colors are the only ones that are fully saturated in the sense that, for any point on the line, no other possible color being a mixture of red and violet is more saturated than it.\n"}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The RGB color model, although theoretically capable of approximating the colors of the line because it is an additive system, usually practically fails because of the limitations of the light source used. The boundary of sRGB (pictured) runs approximately parallel to the line, connecting the primaries red and (color wheel) blue, and thus purples near the line are absent from the gamut of sRGB. Magenta ink, which is one of CMYK's primaries, is also very distant from the line for the reason explained above. The wide-gamut RGB color space approximates the colors on the line better, but devices capable of displaying colors with this enhanced system are prohibitively expensive for ordinary consumers.\n"}]}]}]},"filetags":{},"backlinks":[{"path":"/20221214154901-perception_of_color","title":"perception of color"},{"path":"/20230808110549-psychedelic_dinosaurs_four_dimensional_hummingbirds_and_how_we_got_our_vision_color_consciousness_and_the_dazzling_universe_of_tetrachromacy_the_marginalian","title":"[[https://www.themarginalian.org/2022/08/10/ed-yong-an-immense-world-color/][Psychedelic Dinosaurs, Four-Dimensional Hummingbirds, and How We Got Our Vision: Color, Consciousness, and the Dazzling Universe of Tetrachromacy – The Marginalian]]"}]},"__N_SSG":true}