{"pageProps":{"title":"cuckoo bird","hast":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It took a while for them to just come out and tell her, because it was the sort of embarrassing thing that everyone ought to know for themselves, whose existence you still had to inform someone of for the first time. Everyone appeared to try their best to forget about it and they did it so well that the remembering came hard. So when she found out, she wasn't really told anything about what it meant or why it mattered, and of the things she had been told in passing so late this was the only one among them that was important - so she didn't know it was important at first. Being the sort to not talk to other people very much, it was some time before the varying strategies of her peers' parents and aunts and uncles in disclosing these unfortunate realities could seep through to help her triangulate the truth (or closer to the truth) as many of her peers had. So: she was a cuckoo, and an egg-eater, and a little unsafe for the other children, and none of these things were very important at first. Her teachers still praised her and the children still kept their distance and all the smiling adults looked like they regretted smiling. She learned to be penurious with her smiling as well.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"But one day a different sort of bird came into the school and looked about until she found her, and smiled without reservation, and she smiled back, because it felt good and it caught her off guard. And the rest of the children shrank away and the other adults were not smiling at all. So that was the end of her being able to go the same school and meet with the same people and keep her distance from the same children and impress the same teachers. The smiling different woman did not stay, and she herself could not stay either. She took herself off, but couldn't find anywhere to land for very long. Around the world she traveled, and she found many holes to hide in. She learned what it was to be a cuckoo - to be someone that stole, and defrauded, and generally muscled into where she didn't belong on the good graces of everybody who did. All of the places looked the same and all of them hurt the same - a quiet building-up of pain like dust that settled on her shoulders and bowed her head as she flew, that kept her stiff as she rested, that marked her out further as ragged and tired and generally not the settled sort.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It mattered less on the wing that she was a cuckoo, and less in the wider world in general. Many were like the smiling woman who she met on that first day. They were beautiful and joyous and she didn't know what to do with it. Some had hardened to a shine. Some spilled hearts-blood into the wind where it marked a trail. She managed herself in traffic and landed wherever she could as soon as she could. She hid and hid and hid, trying to sleep, and her cuckoo's heart was soothed for a time by the unfamiliarity of the hiding place, by the sense that it had been stolen and didn't belong to her. But no one else was there. No one else loved her. And so every hiding place rang hollow in the span of three or four days, and she left.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Sometimes she would be invited in to a place. And there, she would be loved, but afraid. It is a much more dangerous prospect to be given something than to take it.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"So eventually she tried to live as a cuckoo was imagined to live by her fearful parents who couldn't bring themselves to tell her, and she took. She stole more than a few nights of warmth and shelter and laughter, adding a day at a time to the comfortable places. He feathers itched and rotted, and she screamed at the people who tried to love her and they did not understand why, because she hadn't told them she was a cuckoo and was stealing their lives from them in tithe. The itch would not dissipate. So eventually she had to leave, and leave the life behind.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"One day she saw a small cuckoo and knew her for a daughter. She smiled in the daughter's face, but could not make herself reserve the smile. And so the daughter, too, had to fly away.\nAnd one day, she ran out of places. There was nowhere left to go that had not already known her and that she had not already known. So she returned to her birthplace, where they had forgotten her, as people try their best to do with cuckoos. And so she lay with her father and ate her mother's egg to replace it in revenge. She lay in her old bed after she had done it and wondered where she had felt comfortable, because this bed with its dreams was powerful but not restful on this night of adulthood. She did not fit in it.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The next morning in her school she did not fit either.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Nothing fit.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"And so she carved out a hole in her shape and lay in it to check the fit in case death and burial were the only answer. But there, too, she did not fit. And so she sang.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"She put herself in entirety into the song, and when she was done the air could hold her. The ears of the listeners could not shut her out. There was no lie to learn and exorcise. There was nothing in it and nothing in her - it was just something to do, in the end - but she dropped dead, head where her tail was meant to go and tail where her head was meant to go, into the hole she had carved. heart stopped.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"And she was buried shallow and they said she and death didn't quite get on; but it wasn't true, because she'd sung off the balance of her disagreements and the rest of her fit in the grave just fine.\n"}]}]},"filetags":":write:","backlinks":[]},"__N_SSG":true}