{"pageProps":{"title":"[[https://archiveofourown.org/works/314073?view_full_work=true][Skybird - windsweptfic - Inception (2010) [Archive of Our Own]​]]","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://archiveofourown.org/works/314073?view_full_work=true"},"children":[{"type":"text","value":"https://archiveofourown.org/works/314073?view_full_work=true"}]}]}]},{"type":"element","tagName":"h1","properties":{"id":"what-is-it-about-apologies"},"children":[{"type":"text","value":"What is it about apologies?"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"They aren't an admission that you were wrong, because if they were, Eames either wouldn't be able to apologize to Arthur or would be able to apologize first. Instead he can only do it after he's heard how sorry Arthur is first - and then he can admit he's sorry too, or maybe he only feels it then. You can know all the way around yourself, and this can still happen: a situation where someone is standing in front of you, and you love them, and you're hurting them, and you can't let it go. Apologies are for the way things are right now. They aren't promises to fix it, so much as they are acknolwedgments that this situation and these emotions are going to leave you changed. You might not even know quite how, yet; in fact I think you mostly don't. Sorries are stories. Sorries are "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"tragedies"}]},{"type":"text","value":". They are markers for everyday and momentous tragedies alike. Dukha. Dissatisfaction. Sorry the world is how it is. Sorry I am how I am and you are how you are. Sorry you're hurting. Sorry she died, or he left, or you lost a limb, or a child, or a lover, or a dream.\n"}]}]},"filetags":{},"backlinks":[]},"__N_SSG":true}