{"pageProps":{"title":"Teaching Is Learning Is Teaching","hast":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In 2016 I attended a workshop run by the Centre for Applied Rationality - a nonprofit organization dedicated to refining the applications of cognitive and behavioral science in order to improve human decision making in ways that actual humans might reflectively endorse. Interestingly, their work drew heavily from theory of pedagogy, especially mathematical pedagogy. There seems to be a deep connection between the "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"formation"}]},{"type":"text","value":" of knowledge and its "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"transmission"}]},{"type":"text","value":", at least in humans; to the point where these are hard to disambiguate. Certainly the compulsion of the "},{"type":"element","tagName":"a","properties":{"href":"https://en.wikipedia.org/wiki/Linguistic_relativity"},"children":[{"type":"text","value":"Sapir-Whorf hypothesis"}]},{"type":"text","value":", despite its comprehensive disproof, attests to the power of this connection (as its disproof attests to the connection's subtlety).\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"A key concept I learned in that workshop was "},{"type":"element","tagName":"a","properties":{"href":"/20210721200800-cfar_modules#pedagogical-content-knowledge"},"children":[{"type":"text","value":"pedagogical content knowledge"}]},{"type":"text","value":": defined as the portion of one's knowledge about a particular domain that is critical to being able to transmit it to others. An example drawn from mathematical pedagogy is the insight that some people encode ideas visually, whereas other encode them syumbolically; and that this presents as differences both in how someone might choose to explain a concept, and how well someone understands an explanation in a given mode. (A good parlor trick: ask everyone in the room to silently multiply two three-digit numbers, and then go around the room asking everyone the exact steps they took while doing it. This is special fun in Indian undergraduate STEM circles, where everyone has developed excellent, often esoteric, heuristics and tricks for being able to perform this task quickly in exam settings. I'd imagine there's analogous fun to be had in competitive circles of all domains.)\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Much, but not all, pedagogical content knowledge (hereafter PCK) is symmetric: the information needed to successfully communicate with someone about a concept within a given concept space is the same "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"regardless of which person is teaching or learning"}]},{"type":"text","value":". Some nonempty portion of PCK will be unique to an individual.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"This symmetric fragment of PCK means that teaching is inextricable from learning, which would seem to argue that learning something is always at least a little bit social. But the fragment that "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"isn't"}]},{"type":"text","value":" symmetric means that learning is perforce "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"agentic"}]},{"type":"text","value":" - there is a unique way in which every human being has to participate in their own learning, that cannot be taught, that must nevertheless be enacted. To the extent that one's personal PCK is unknown to one's teachers, self-directed learning is the "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"only possible mode"}]},{"type":"text","value":". Teachers, like tuning forks, are there to resonate with a sound you are already making.\n"}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Therefore a sage has said, 'I will do nothing (of purpose), and the people will be transformed of themselves; I will be fond of keeping still, and the people will of themselves become correct. I will take no trouble about it, and the people will of themselves become rich; I will manifest no ambition, and the people will of themselves attain to the primitive simplicity.'\n"}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"/leggeTaoTeChing2013","title":"Tao Te Ching (Legge)"},"children":[{"type":"text","value":"Legge"}]}]}]},"filetags":{},"backlinks":[{"path":"/all_pages","title":"All Pages"}]},"__N_SSG":true}