{"pageProps":{"title":"decompose your goals, synthesise your strategies","hast":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Goals are falsifiable statements about the world state. They are, fully baked, too little information to act on (i.e. to hill climb about). You want to dervie as many partial and approximate checks as you can from your goal, so you can gain a goal-colored heatmap of the state space.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Strategies are play histories that terminate in states meeting the goal. They do not monotonically correspond to the nature of your goals. They are contingent on the heatmap, they follow from the heatmap. Therefore, the way you draw the heatmap will change the way your strategy works. Small changes in the heatmap will correspond to small changes in the strategy. But small changes in the goal decompoisition do not correspond to small changes in the heatmap, nor vice versa.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Probabilistic superpositions of two potential heatmaps will therefore lead to deeply fucked strategies when interpreted through the lens of either heatmap. Evolving information probably leads to strategy paths that look like stream dynamics, or the physics of chains, or refracting light - they will exhibit \"awareness-in advance\".\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Assume goals are static. If this is what you assume about a human, then the \"goal\" will resemble nothing so much as a runtime environment - an opinionated Turing-complete process. Every feature we might consider meaningful will be derived in large part from path and state.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Assume humans are bounded reasoners. They will not be able to encode winning strategies. Forward prediction of winning strategy features is going to exhibit all the fuckery aformentioned and described; not divide neatly into parts corresponding to subgoals in time, subgoals, or probability-space; and be influenced by deeply odd subformulae of the goal sentence. Strategies are all we can observe, so this makes accessing goals weird and hard and usually impossible. Any identifiable patterns or regularities in strategy (i.e. in behaviour) are therefore deeply valuable commentary on both goals and strategies, but should also be understood to house dragons when subjected to analysis.\n"}]},{"type":"element","tagName":"h1","properties":{"id":"todo-explain-this-in-terms-of-the-linear-wumpus-world"},"children":[{"type":"text","value":"todo explain this in terms of the "},{"type":"element","tagName":"a","properties":{"href":"/20250214180207-linear_wumpus_world"},"children":[{"type":"text","value":"linear wumpus world"}]}]}]},"filetags":{},"backlinks":[]},"__N_SSG":true}