{"pageProps":{"title":"Collections: Bread, How Did They Make It? Part I: Farmers! – A Collection of Unmitigated Pedantry","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://acoup.blog/2020/07/24/collections-bread-how-did-they-make-it-part-i-farmers/"},"children":[{"type":"text","value":"https://acoup.blog/2020/07/24/collections-bread-how-did-they-make-it-part-i-farmers/"}]}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Risk Control\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I led in with all of that risk and vulnerability because without it just about nothing these farmers do makes a lot of sense; once you understand that they are managing risk, everything falls into place.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Most modern folks think in terms of profit maximization; we take for granted that we will still be alive tomorrow and instead ask how we can maximize how much money we have then (this is, admittedly, a lot less true for the least fortunate among us). We thus tend to favor efficient systems, even if they are vulnerable. From this perspective, ancient farmers – as we’ll see – look very silly, but this is a trap, albeit one that even some very august ancient scholars have fallen into. These are not irrational, unthinking people; they are poor, not stupid – those are not the same things.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"But because these households wobble on the edge of disaster continually, that changes the calculus. These small subsistence farmers generally seek to minimize risk, rather than maximize profits. After all, improving yields by 5% doesn’t mean much if everyone starves to death in the third year because of a tail-risk that wasn’t mitigated. Moreover, for most of these farmers, working harder and farming more generally doesn’t offer a route out of the small farming class – these societies typically lack that kind of mobility (and also generally lack the massive wealth-creation potential of industrial power which powers that kind of mobility). Consequently, there is little gain to taking risks and much to lose. So as we’ll see, these farmers generally sacrifice efficiency for greater margins of safety, every time.\n"}]}]}]},"filetags":{},"backlinks":[{"path":"/20230909171551-stag_hare_game","title":"stag-hare game"},{"path":"/all_pages","title":"All Pages"}]},"__N_SSG":true}