{"pageProps":{"title":"Canonical form progressions","hast":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Rather akin to a kata in karate, or a teaching-piece in classical music, a well-designed course of "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"canonical forms"}]},{"type":"text","value":" for skilled activity will begin as a way to isolate the training of specific components; and at intervals, pose the challenge of "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"integrating"}]},{"type":"text","value":" the components mastered so far. What serves in the first pass as a structured introduction to many moving pieces, evolves in further passes into a way to engage with familiar components, discover their complexities and interrelationships, and refine their execution; in addition, to develop "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"taste"}]},{"type":"text","value":" around the skill, as one continually observes oneself within the controlled context of the form.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Consider it akin to a course of experiments, or a course of software development tests - predictable by design, but escalating in complexity nonetheless.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"An argument can be made here for the design of a canonical form, especially for creative or imporvisational skills, being in part a "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"poetic"}]},{"type":"text","value":" endeavour: by which I mean, subject to a poetics, a set of injunctions that derive from or constitute an "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"aesthetics"}]},{"type":"text","value":". The best reason to locate pedagogical theories in the realm of art is because the endeavour at its heart is one of communication - the transmission, baldly syllogistic or otherwise, of something to an audience that does not yet comprehend.\n"}]}]},"filetags":{},"backlinks":[{"path":"/all_pages","title":"All Pages"}]},"__N_SSG":true}