{"pageProps":{"title":"Critique of Contrapoints: Envy","hast":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The essay feels like a reach. It relies too much on simplication and glossing of detail. This means it collapses in key places.\nThe bit about \"anti-immigration is about envy\" in particular feels insufficently supported? It feels like she's privileging the hypothesis, and also stretching her original definitions to accomodate the hypothesis in the first place.\nThere's something to be said about cultural taboo and how it comes out in a culture's shadow; claiming that \"envy is not in the American social lexicon\" could be pointing to a taboo, but that's not what the essay argues. Acting from fear or anger that one will be the target of envy happens just as much in American culture, both modern and historical.\n"}]},{"type":"element","tagName":"ul","properties":{},"children":[{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Look at the Gilded Age class dynamics.\n"}]}]},{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Look at East Coat old money WASP prestige culture. (Rewatch Legally Blonde. Find and reread that excellent Aeon article about poverty posturing at Yale.)\n"}]}]},{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The idiom \"keeping up with the Joneses\".\n"}]}]},{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Trickle-down naming trends.\n"}]}]},{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Read MAGA rhetoric at all, find envy within 200 words.\n"}]}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In short, American old money acts, and is perceived by others, in the same way old money everywhere does.\nGiven that class tension is the primary environment she's exploring envy in, there is nowhere near enough justification for American exceptionalism here.\nAlso she never uses the word Malthusian, and this feels like an oversight. Envy (fairness impulse) and avarice (scarce resource impulse) are deeply synergistic. In a discussion about anti-immigration attutiudes, this would have been interesting.\n"}]}]},"filetags":{},"backlinks":[]},"__N_SSG":true}