{"pageProps":{"title":"How ‘Mr. Robot’ Uses Lower Quadrant Framing to Create a Feeling of Oppression and Isolation - Bold Entrance","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://boldentrance.com/mr-robot-lower-quadrant-framing-creates-oppression-and-isolation/"},"children":[{"type":"text","value":"https://boldentrance.com/mr-robot-lower-quadrant-framing-creates-oppression-and-isolation/"}]}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Another way to look at the composition is the relationship between the subject and the surrounding space. The subject is the “positive space”, while everything surrounding the subject is the “negative space.” If you increase the amount of negative space around the subject then this can create visual tension and the feeling that something is not quite right.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Mr. Robot employs this device in almost every shot. By sliding a character down the frame to the lower right or left corners of the frame, cinematographer Tod Campbell has moved from conventional framing to the more unconventional lower quadrant framing. Head room is increased significantly creating an uneasy feeling of something looming or hanging over the characters heads.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"More negative space elicits a feeling of oppression. The more the negative space fills the frame, the more the sense of its presence. Attention is frequently distracted by the negative space whether filled with giant screens in Times Square, the comings and goings of traffic and people, or just the empty space of a room. There is a visual dissonance as characters are made to feel unimportant and oppressed by the massive systems of society that surround and dominate them. Often it feels like characters are being forced out of the frame entirely.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In Mr Robot, as a consequence, the audience begins to feel how Elliot feels. And see the world through Elliot’s eyes.\n"}]}]}]},"filetags":{},"backlinks":[{"path":"/20221214121510-composition","title":"Composition"},{"path":"/all_pages","title":"All Pages"}]},"__N_SSG":true}