{"pageProps":{"title":"The Little-Known ‘Slow Fire’ That’s Destroying All Our Books ‹ Literary Hub","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://lithub.com/the-little-known-slow-fire-thats-destroying-all-our-books/"},"children":[{"type":"text","value":"https://lithub.com/the-little-known-slow-fire-thats-destroying-all-our-books/"}]}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"How to fix a book: first, gather your tools. The bone folder that feels familiar in your hand, the knitting needles still sticky with glue, the X-Acto knife, the tiny Tupperware of glue.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Then, diagnose the damage. If there’s scotch tape, grab the lighter fluid. If the book is on its last leg, worn out, prepare to make a box. Check that the guillotine is free.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Sometimes you need to be brutal, eschewing sentimentality as you cut off a spine or replace a book’s old, water-stained cover. At other times, gentle, delicate—especially with the books from Special Collections, those unique, fragile (and expensive) texts. And sometimes you find books with yellowed, stiff pages. The old dog-eared folds break off in triangles, flutter to the floor. These books can’t be helped by simple repairs—they’re acidified, dying, and the opposite of unique. In fact, they’re examples of a large-scale catastrophe that’s been quietly building in libraries for decades.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It’s called a “slow fire,” this continuous acidification and subsequent embrittlement of paper that was created with the seeds of its own ruin in its very fibers. In a 1987 documentary on the subject, the deputy Librarian of Congress William Welsh takes an embrittled, acid-burned book and begins tearing pages out by the handful, crumbling them into shards with an ease reminiscent of stepping on a dried-up insect carcass.\n"}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Sure sign of apocalypse.\n"}]}]},"filetags":{},"backlinks":[{"path":"/all_pages","title":"All Pages"}]},"__N_SSG":true}