{"pageProps":{"title":"alternate photographies","hast":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Memory of SoMA notes for Gerhard Richter: he had this preoccupation with ways to \"graph\" or \"record\" light that were less straightforward, but still somehow importantly linked to the behaviour of the light in situ, without an interpretive phase that might mar the faithfulness of the recording.\nWhy? Well, it seems like going by his later preoccupations with chance, the properties of paint (behaviour under application and removal), and deconstruction of meaning, it's because he's doing medium-is-the-message-y type things and trying to talk about why the interpretive layer is boring if given too much latitude, and respecting constraints of \"what is actually there\" or honestly any systematic constraints at all makes for sharper focus and better work - work that accomplishes something. This my interpretation. We can go follow up if it ever becomes important to get his interpretation.\nIt's important to note that "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"restricting"}]},{"type":"text","value":" interpretation isn't "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"removing"}]},{"type":"text","value":" it. Photography, whether by camera or Richterian gimmick, hardly removes all interpretation - plenty of room for that in arrangement of the circmstance, from subject to lighting to  contrivances of optics.  don't thn t's "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"opossble"}]},{"type":"text","value":" to separate out interpretation from perception in the first place, and it's much harder to do in the setting of fine art. It's a convention!\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Related: "},{"type":"element","tagName":"a","properties":{"href":"/cliche_verre_wikipedia"},"children":[{"type":"text","value":"Cliché verre - Wikipedia"}]}]}]},"filetags":{},"backlinks":[{"path":"/20230808110549-dm_s_esoteric_programming_languages_piet","title":"[[https://www.dangermouse.net/esoteric/piet.html][DM's Esoteric Programming Languages - Piet]]"},{"path":"/all_pages","title":"All Pages"}]},"__N_SSG":true}