{"pageProps":{"title":"Intention","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"authors"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"text","value":"Anscombe, Gertrude Elizabeth Margaret"}]}]},{"type":"element","tagName":"h1","properties":{"id":"psychological-truth-lying-to-self-has-got-to-bottom-out-somewhere"},"children":[{"type":"text","value":"psychological truth: lying to self has got to bottom out somewhere."}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"This doesn't allege anything about reflective.\n"}]},{"type":"element","tagName":"h1","properties":{"id":"action-under-a-description"},"children":[{"type":"text","value":"action under a description"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Anscombe writes that intention is an action, taken together with a description of that action that meets some applicability criteria:\n"}]},{"type":"element","tagName":"ul","properties":{},"children":[{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"the description D either describes the events involved in the action directly, or serves as a reasonable response to the question \"why are you doing action D"},{"type":"element","tagName":"sub","properties":{},"children":[{"type":"text","value":"0"}]},{"type":"text","value":"?\"(where D"},{"type":"element","tagName":"sub","properties":{},"children":[{"type":"text","value":"0"}]},{"type":"text","value":" is another description of the action.) \n"}]}]},{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"a change in the description D would mean a change in the description \"below\" (eg. pumping water to match the rhythm of \"Bohemian Rhapsody\" vs. pumping to the rhythm of \"God Save Our Queen\"; contrast \"I am poisoning my neighbours to prevent their being elected to the homeowners' association\" vs. \"I am poisoning my neighbours to rid myself of their late night noisemaking\": in the latter case, the actions involved in the poisoning, which is the underlying description, remain unchanged.)\n"}]}]},{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The description D participates in the model of the action that the actor themselves is using - they cannot be unaware, or heedless, of the description's applicability to the situation, at the time of their taking the action.\n"}]},{"type":"element","tagName":"ul","properties":{},"children":[{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"This means that the only available witness to an intention is the actor themselves; however, the actor remains a "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"witness"}]},{"type":"text","value":" to the intention. It is a mental phenomenon that cannot itself be treated as either action or event.\n"}]}]}]}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Anscombe draws a sharp distinction between \"observable\" reality and \"interior\" reality, which is known but not \"observed\". The example she takes is unfortunately confusing in the present era - she characterises proprioception as \"interior\", i.e. a knowledge that one \"knows but does not observe\".The purpose of this distinction is to ensure that we possess a nonicrcular definition for intention at all: intentions being modeled as \"action-originating artifacts created from the agent's model of reality\", we are required to find a way to define action without using the notion \"intentional\" - this we do by taking the entirety of an agent's causal neighbourhood, and carving away those parts which cannot become \"knowledge\" - i.e. manifest as a true thought, a proposition in the agent's world-model. This unfortunately leaves the case of \"involuntary\" and \"unintended\" actions, eg. startling; while it seems satifactory to my modern, process-model-informed theory of mind to construct knowledge in terms of surprisal directly, Anscombe falls back on mind-body dichotomy constructions - creating a class of knowledge that one possesses \"somehow\", which gives rise to the class of causes and effects that \"pass through\" an agent without touching upon their agency.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Akin to the Cartesian construction of the mind-body problem, this also constructs an \"unassailable mind\" - one which can be misinformed and evil, to be sure, but whose machine integrity is neither composite nor fundamentally capable of being compromised. A strict hierarchy is constructed, wherein model follows observation, intention arises from model, and action follows intention - a superficially dynamic structure, but one which relies on an essence, a privileged core, of \"non-observational\" character, in order to keep the construction narrow enough to be expressive. This structure already allows for someone to \"intend to not have to form an intention\" - i.e. to shape circumstances, even circumstances interior to cognition, such that their own navigation takes on a certain shape following the shaped environment. To remove this core of \"unassailable truth\" from the agent's nature would be to make it possible to \"directly\" set an intention - that is, to render oneself indistinguishable, even to the self, from an agent that holds any given intention. That we wish to discuss the nature of thought without descending into solipsism requires us to reserve a \"seat of the soul\". This schism will pose many problems at its edges, but is serviceable for the typical cases.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It does seem worthwhile, in the course of our spherical cow construction, to avoid altogether the question of whether one can meaningfully \"decide to think\" something without it being a pretence; and the problems with mapping the boundary of volition properly are openly acknowledged in the text, and deliberately sidestepped. I would, if I could nonethless press the author in conversation to attempt an expedition into this territory, begin by asking how she might model someone \"drinking to forget\", or \"learning to love\".\n"}]}]},"filetags":":stub:","backlinks":[{"path":"/20221115163511-action_under_a_description","title":"action under a description"},{"path":"/20230909074034-g_e_m_anscombe","title":"G.E.M. Anscombe"},{"path":"/all_pages","title":"All Pages"}]},"__N_SSG":true}