{"pageProps":{"title":"[[https://nitter.unixfox.eu/i/status/1527334796900245504][QC (@QiaochuYuan): \"one of the first things you learn when you start writing mathematical proofs is the principle of explosion: from a single false premise you can derive any conclusion, true or false. interesting to reflect on how this has shaped my thinking and orientation towards truth\" | nitter-unixfox]]","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://nitter.unixfox.eu/i/status/1527334796900245504"},"children":[{"type":"text","value":"https://nitter.unixfox.eu/i/status/1527334796900245504"}]}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"ah we can also bring in \"dead neurons\" from the QRI post on neural annealing: a neuron in a neural network that gets stuck at either 0 or 1, becomes insensitive to new information, and propagates its own stuckness and insensitivity through the network\nthis is a technical metaphor for understanding how people can end up mentally and emotionally inflexible if they don't \"anneal\" - e.g. by taking psychedelics or otherwise experiencing ecstatic states that shake up and loosen their beliefs\n"},{"type":"element","tagName":"a","properties":{"href":"https://www.qualiaresearchinstitute.org/blog/neural-annealing"},"children":[{"type":"text","value":"https://www.qualiaresearchinstitute.org/blog/neural-annealing"}]}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I suspect this might be a strong frame for understanding the ‘psychological cruft’ which builds up in brains, and how and why regular annealing is so healthy: over time, sensitive neurons can slide into this broken state, shifting from conditional values to the neurological equivalent of static 0s and 1s. In this case I would expect more neuroticism, less flexible thinking, lower emotional resilience, and worse \n from people who haven’t annealed recently: lots of all-or-nothing thinking. But by injecting lots of energy into the system, enough of the internal and external context of these neurons is shifted such that some of them may get ‘reset’ and regain their conditional processing state. At the very least, this self-reorganization process can allow these neurons to move to less-critical points in processing networks.\n"}]}]}]},"filetags":{},"backlinks":[{"path":"/all_pages","title":"All Pages"}]},"__N_SSG":true}