{"pageProps":{"title":"Epistemic games","hast":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Games where players are not assumed to have perfect common knowledge of the gameboard, game history, or current place in it.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Sources: "},{"type":"element","tagName":"a","properties":{"href":"/blackburnHandbookModalLogic2006","title":"Handbook of Modal Logic"},"children":[{"type":"text","value":"Blackburn…"}]},{"type":"text","value":", "},{"type":"element","tagName":"a","properties":{"href":"/benthemmodal2010","title":"Modal Logic for Open Minds"},"children":[{"type":"text","value":"prefix=van"}]}]},{"type":"element","tagName":"h1","properties":{"id":"email-exchange-regarding-the-above-and-other-things-with-prof-benthem"},"children":[{"type":"text","value":"Email exchange regarding the above (and other things) with Prof. Benthem:"}]},{"type":"element","tagName":"div","properties":{"className":["example"]},"children":[{"type":"text","value":"A question about varying epistemic games to create composable partial games\n\n\nBenthem, Johan van <j.vanbenthem@uva.nl>\tTue, Oct 8, 2019 at 1:32 AM\nTo: Sahiti Chedalavada <sahiti93@gmail.com>\nCc: \"johan@stanford.edu\" <johan@stanford.edu>\nDear Sahiti,\n\n\nI was held up by my birthday in China and other events.\n\nNice topic! The idea of composable partial games is attractive.\n\nIt reminds me somewhat of the game logics that I discuss in\nPart V of my book \"Logic in Games\", attached. Check it out.\n\n\nLet me also point you to this recent survey that I wrote with\n\nDominik Klein for the Stanford Encyclopedia of Philosophy:\n\n\nhttps://plato.stanford.edu/entries/logics-for-games/\n\nYour idea of operating at the 'knowledge boundary' also\nappeals to me, though I cannot yet see a precise definition.\n\nThere may be work already along the lines you mention\n\nwhich I am not aware of: you might check with Dr. Dominik\nKlein in Bamberg/Bayreuth, and more in a CS setting, with\n\nProfessor Ram Ramanujam, Mathematical Institute, Chennai.\n\nWith best wishes,\n\n\nJohan van Benthem\n\n--------------------------------------------\nJohan van Benthem, Professor of Logic\nUvA, Stanford and Tsinghua University\nhttp://staff.fnwi.uva.nl/j.vanbenthem\n范丙申\n\n\n\nFrom: Sahiti Chedalavada <sahiti93@gmail.com>\nSent: Wednesday, September 25, 2019 1:27 PM\nTo: Benthem, Johan van\nSubject: A question about varying epistemic games to create composable partial games\n \nDear Professor van Benthem,\n\nI’m a Master’s student at the Indian Institute of Information Technology, Hyderabad. I have a question about whether it’s possible to model players “leaving” a coalition as if they are players in an epistemic game who change their strategy in response to information gained over the course of play.\n\nI draw from your chapter on epistemic games in Modal Logic for Open Minds; the methods you lay out in that chapter to express the limitations of player knowledge seem tailored to express the intersection of the knowledge bounds of different players. I’ve tried to tweak this approach in order to better express the fine structure of the boundary of knowledge in a game, instead. My interest is in using this representation to model coalitional reasoning about partial games, so that I can fit together a representation of players changing policies mid-play because of a change in context.\n\nAs you lay it out in the textbook, in an epistemic game, partial knowledge is modeled with an equivalence relation across game states to express what is indistinguishable in a given player’s perception. This makes it easy to express interesting things about how player’s differing perceptions interact - since equivalence relations overlap in neat, intelligible ways - but difficult to express any patterns in what a player does or doesn’t know.\n\nI wanted to attempt making the converse tradeoff - expressing and using the patterns in a knowledge boundary at the cost of expressing and using the intersections between player knowledge boundaries. It seemed interesting to explore what it might mean for a collection of players to play half a game.\n\nThe “outcome” of a partial game would necessarily have to be a series of mutually agreed-upon assertions about play, rather than the state reached at the end of play. Assuming that the “partially specified” game is not merely a play-history tree that can be glued to other trees:\n\ninstead of\nmoves\na core\nan end state\nplayers would have\nstrategies\na core\nan effective “pruning” of the tree\nWhere a “pruned” tree is a play-history tree that is void of the states that the core coerced into unreachability for its own gain.\nRepresenting the gameboard as a concurrent game structure, as used to model alternating-time temporal logic, would allow for the partial specification of a gameboard using ATL, in a way that is by construction conducive to reasoning about viable coalitional strategies. Given a partial concurrent game structure (assuming it expressed at least one concrete “payoff” in a potential unspooled future), it should be possible to derive or verify its “pruned” version - the effective game, after considering player strategy.\n\nBecause of this finite open ended way of representing player strategy construction, it would become possible to “compose” both partial games and their corresponding “prunings” via logical combinations of their specifications.\n\nAs play proceeds across this chimeric gameboard, what a player or coalition treats as an optimal strategy would also necessarily change. Conditional loyalty, while simple to express in simple examples, quickly becomes hard to model naturally. My hope is that the above is a reasonably elegant and powerful representation of this behaviour, enough for it to predict complex instances of players choosing to “switch sides”, “flout rules” (eg. as in Grice's maxims), or “cheat”.\n\nA possible application of this approach would be a game-theoretic account of collaborative authorship/revision of a language by its speakers. Where the use of language is itself a game (a la David Lewis), the deliberate flouting of that game’s rules constitutes a play in a larger containing game, which over time ends up somehow adding up to a transition in the language’s standards.\n\nI’d appreciate your thoughts on the above. Is it possible, or am I overlooking something? How would you advise me to refine this? Do you know of any resources that would help me?\n\nThank you for your time and consideration.\n\nBest Regards,\n\nSahiti Chedalavada\n\n\n\n--\n-- \"Darn it!\" said Edmund. \"I've left my new torch in Narnia.\"\n\n"}]}]},"filetags":{},"backlinks":[{"path":"/20170606183600-roles_an_utterance_can_play","title":"Roles an utterance can play"},{"path":"/all_pages","title":"All Pages"},{"path":"/novikovReflexionControlMathematical2014","title":"Novikov, Dmitry A. and Chkhartishvili, Alexander G., Reflexion and Control: Mathematical Models"}]},"__N_SSG":true}