{"pageProps":{"title":"Consensus Decision Making - Seeds for Change","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://www.seedsforchange.org.uk/consensus"},"children":[{"type":"text","value":"https://www.seedsforchange.org.uk/consensus"}]}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Start by introducing and clarifying the issue. This ensures that everyone has the relevant background information and the group is clear about the remit of the discussion and key questions to resolve.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It can be tempting to launch straight into problem solving. However, a key stage in consensus is opening out the discussion to allow everyone to share their feelings, needs and opinions, before trying to find a solution. Recognising all the different things that are going on for people first is essential for finding a solution which suits everyone. Resist the temptation to make proposals at this stage. If ideas come up you could hear them briefly and then park them for the next stage.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Once you’ve got a good understanding of what is important to people, you can collect and explore all the ideas for moving forward. Looking at the pros and cons of different ideas helps the group with really understanding everyone's key needs and concerns.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The group then looks for common ground and weeds out some of the options, combining all the useful bits into a proposal.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Clarifying and amending the proposal helps to address any remaining concerns.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Test for agreement by clearly stating the final proposal and asking people to signal whether they agree or disagree. This stage is important to check if there are concerns that haven’t been heard. If you don’t have consensus go back to an appropriate earlier stage in the process.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Finally work out how to implement the decision. Making sure group decisions are acted on is essential for building trust in your meetings.\n"}]}]}]},"filetags":{},"backlinks":[]},"__N_SSG":true}