{"pageProps":{"title":"[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Directory-Variables.html][GNU Emacs Manual: Directory Variables]]","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"https://www.gnu.org/software/emacs/manual/html_node/emacs/Directory-Variables.html"},"children":[{"type":"text","value":"https://www.gnu.org/software/emacs/manual/html_node/emacs/Directory-Variables.html"}]}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Sometimes, you may wish to define the same set of local variables to all the files in a certain directory and its subdirectories, such as the directory tree of a large software project. This can be accomplished with directory-local variables. File local variables override directory local variables, so if some of the files in a directory need specialized settings, you can specify the settings for the majority of the directory’s files in directory variables, and then define file local variables in a few files which need the general settings overridden.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The usual way to define directory-local variables is to put a file named .dir-locals.el24 in a directory. Whenever Emacs visits any file in that directory or any of its subdirectories, it will apply the directory-local variables specified in .dir-locals.el, as though they had been defined as file-local variables for that file (see Local Variables in Files). Emacs searches for .dir-locals.el starting in the directory of the visited file, and moving up the directory tree. To avoid slowdown, this search is skipped for remote files. If needed, the search can be extended for remote files by setting the variable enable-remote-dir-locals to t. \n"}]}]}]},"filetags":":emacs:","backlinks":[{"path":"/20240819164447-direnv","title":"direnv"},{"path":"/20240822193504-emacs","title":"Emacs"},{"path":"/all_pages","title":"All Pages"}]},"__N_SSG":true}