{"pageProps":{"title":"How To Get Better at Painting – Without Painting Anything","hast":{"type":"root","children":[{"type":"element","tagName":"dl","properties":{},"children":[{"type":"element","tagName":"dt","properties":{},"children":[{"type":"text","value":"url"}]},{"type":"element","tagName":"dd","properties":{},"children":[{"type":"element","tagName":"a","properties":{"href":"http://www.learning-to-see.co.uk/how-to-get-better-at-painting-without-painting-anything"},"children":[{"type":"text","value":"http://www.learning-to-see.co.uk/how-to-get-better-at-painting-without-painting-anything"}]}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Performance is:\nThe employment of a lot of different skills together, at the same time. If you’re painting, you’re having to think about values, brush control, colour, technique, composition, drawing – all together.\nCreating something finished. For us, that means a drawing, painting, or sculpture. That also means pressure, since we tend to judge ourselves by the results.\nRepeated mistakes. It’s too easy to fall into the same patterns, the same idiosyncrasies, when performing. Very often, that can mean repeatedly doing things in a way that doesn’t result in improvement at all. Think about drawing accuracy. If you repeatedly misjudge distances too large, but never check to see that you’re doing that, you will further ingrain the bad habit by doing it more often. You get better at doing something badly.\nPractice is:\nDoing one thing at a time in a very focused way. Instead of trying to get the drawing and the colour right at the same time, you might be practising only judging distances by eye (which will improve your drawing accuracy), or mixing colour, or matching values.\nDone purely for the sake of improvement. The intended result is not a beautiful painting or drawing, it is improvement in the skills that the creation of a beautiful painting requires.\nRepeatedly doing it right. By using feedback to make sure that you correct habitual mistakes and practice doing things the right way, you ensure improvement over time.\n"}]}]},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The difference between scrimmage and drill\nScrimmage attempts as much as possible to replicate the conditions of performance, but under more controlled conditions. For painters, an example might be painting a small still life that you can complete quickly, or doing a block-in for a portrait.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"But it’s not where you develop your skills. The big drawback of scrimmage is that, like performance, it allows you to persist in bad habits. Because, as with performance, you’re employing and integrating a lot of different skills at once. You don’t know what you’re doing right and what you’re doing wrong.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Drill, on the other hand, means isolating a specific skill – judging the distance between two points, say, or matching a perceived value as closely as you can – and practising it repeatedly, with feedback, so that you can see what you’re getting right and what you’re getting wrong.\n"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"If you practice matching values for a while, you’ll probably find – as I and many of the people I work with at Creative Triggers found – that you consistently estimate them too light. That’s a habit that you can correct, and that correction results in real improvement.\n"}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Related: "},{"type":"element","tagName":"a","properties":{"href":"/the-virtue-of-drilling"},"children":[{"type":"text","value":"The virtue of drilling"}]}]}]},"filetags":{},"backlinks":[{"path":"/all_pages","title":"All Pages"}]},"__N_SSG":true}