{"pageProps":{"title":"trompes l'oeil in mulholland drive","hast":{"type":"root","children":[{"type":"element","tagName":"h1","properties":{"id":"original-prompt-feb-8-117-am"},"children":[{"type":"text","value":"original prompt (feb 8 1:17 AM)"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The opening scene to mulholland drive is a trompe l'oeil like the curtains in frida kahlo's last supper referencing painting\n"}]},{"type":"element","tagName":"h1","properties":{"id":"notes"},"children":[{"type":"text","value":"notes"},{"type":"text","value":"   "},{"type":"element","tagName":"span","properties":{"className":["tags"],"id":"notes"},"children":[{"type":"element","tagName":"span","properties":{"className":["tag","tag-ATTACH"],"id":"notes"},"children":[{"type":"text","value":"ATTACH"}]}]}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"the painting is "},{"type":"element","tagName":"a","properties":{"href":"https://www.fridakahlo.org/the-wounded-table.jsp"},"children":[{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"The Wounded Table"}]}]},{"type":"text","value":".\n"},{"type":"element","tagName":"img","properties":{"src":"https://www.fridakahlo.org/assets/img/paintings/wounded-table.jpg"},"children":[]}]},{"type":"element","tagName":"ul","properties":{},"children":[{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"trompe l'oeil : a part of a painting that doesn't \"look like a painting\". Not fiction, but fiction \"masquerading as nonfiction\". Or following the convention of masquerading as nonfiction. the deceit remains incomplete, making the illusion a thing that the painting is \"trying to do\" or \"suggesting the action of\".\n"}]}]},{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"trompe l'oeil is  \"escaping the frame\".\n"}]}]},{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"Millenium Actress"}]},{"type":"text","value":" is trompe l'oeil.\n"}]}]},{"type":"element","tagName":"li","properties":{},"children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"David Lynch is a poem in trompe l'oeil.\n"}]}]}]},{"type":"element","tagName":"h1","properties":{"id":"précis"},"children":[{"type":"text","value":"précis"}]},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"A trompe l'oeil is a device in painting: either an illusion of a non-painting thing from within a painting, or a metonym for such an illusion. Using a trompe-l'oeil allows an artist to complicate, and thereby explore the nature of, the bed of assumptions upon which an audience engages with a painting. When used in this way, we can see that the device generalizes across media: one can make a metonymous allusion to elements that would be \"outside\" the bounds of the implicit agreement between artist and audience that tends to hold within the medium; and such an allusion can be used to explore the nature and properties of that agreement by both enacting and representing the consequences of the violation using the metonym.\nDavid Lynch's "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"Mulholland Drive"}]},{"type":"text","value":" uses trompe l'oeil. Early on, it uses narrative beats from genre film as metonymous allusions to genre filmmaking; as the film progresses, the commentary progresses towards more fundamental terms in the implicit agreement between filmmaker and audience - the relationship of the plot to the protagonist is complicated by performing several plot movements conventionally associated with the establishment of the protagonist role. This interrogation escalates in directness, stripping away by layers the conventions of the medium, eventually decidng to stop with reminding us not to take talkies for granted in a scene where our protagonists go to watch a play where the performers appear to be speaking and the sound suddenly falls out of sync with their lips.\nWhat does this tell us about the nature of film? The suggested causal relationship between all the parts of a film are constructed to be that way by the makers, sometimes by relying on established conventions and sometimes by replicating as closely as possible the visual and auditory experience they are trying to indicate within the confines of the medium. It's all a way to "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"approximate"}]},{"type":"text","value":" justified true belief about a series of happenings. The structure of the medium interacts with the narrative form to embed the imaginary happening in the audience's mind. The alluded violations are to imperfect use of the medium - failure to coordinate light and sound - imperfect use of narrative convention - putting plot elements together in a way that does not cue our attention to attend to and ignore happenings in an established pattern - imperfect causal structure to the plot - events do not follow from each other coherently - imperfect continuity - the same actors are not playing the same characters.\n"}]}]},"filetags":{},"backlinks":[{"path":"/all_pages","title":"All Pages"}]},"__N_SSG":true}