{"pageProps":{"title":"the problem of the copula","hast":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"\"To be\" - the existence connector. It establishes a relation between two things that from one persepective is as featureless as you can get it to be, but from another the most restrictive. In a syllogistic approach, a copula makes reasoning possible; therefore all apologia for syllogism absolve the copula with a  surrounding axiomatic justification. \"We are reasoning within the confines of an abstraction\", or \"we are only saying things inside the portion of universe where things can be said\".  Older, bolder philosophers committed to the conceit of the ontology more seriously - see Leibniz with his \"identity of indistinguishables\", a claim he was making about a reality he treated with seriousness; or Aristotle, who made a non-relational foundation of \"ontology\" and \"identity\" in his theory before attempting to rest his categories upon it. See also Vaisesika thought, which came by identity in a more roundabout fashion but still began with a rational understanding of the universe, presupposing it "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"made sense"}]},{"type":"text","value":", and therefore that the unit of sensemaking was "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"part of reality"}]},{"type":"text","value":" - that the operation(s) represented by the copula (artha, bhava, tatparya) weren't conveniences of cognition, but somehow "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"out there in the world"}]},{"type":"text","value":". To those for whom reality feels solid, not to be trifled with, the copula is a weighty fact, and the restricted reasoners of today who use it in similar fashion without following through to similar consequence represent a bitterness in the intertext.\nPhenomenologists would however assert that the copula does represent a cognitive process, and far from being a convenience it is central to the process of sensemaking. In this interpretation, it's an almsot empty assertion of relation, which can be refined and overloaded any which way the thinker likes.\nWe like Wittgenstein, who likes to opt out of the contentions about the "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"reality"}]},{"type":"text","value":" or otherwise of these games, and notes that they are all useful ways of moving through the world once you have taken the trouble to name their use. At this point in my thinking, everything is rhetoric until proven otherwise (which fortunately it will never be).\n"}]},{"type":"element","tagName":"h1","properties":{"id":"todo-add-links-to-everything"},"children":[{"type":"text","value":"todo add links to everything."}]}]},"filetags":{},"backlinks":[{"path":"/20220830184930-phenomenology_vs_ontology","title":"phenomenology vs, ontology"},{"path":"/all_pages","title":"All Pages"}]},"__N_SSG":true}